sources/InformationRegisters/ГодовыеГрафикиУчебногоПроцесса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ГодовыеГрафикиУчебногоПроцесса</Name>
			<InformationRegisterPeriodicity>Year</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НачалоГода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонецГода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

sources/CommonModules/РаботаССеансом/Ext/Module.bsl
// Получает сокращенное ФИО текущего пользователя для служебок
//
// Возвращаемое значение:
//   Строка   - Содержит сокращенное ФИО
//
 Функция ПолучитьПодписьТекущегоПользователя() Экспорт
 
 	 Возврат ОбщиеФункции.ПросклонятьПользователяДляДокументов(ПараметрыСеанса.ТекПользователь,ПараметрыСеанса.ТекПользователь.Пол)[0];
 
 КонецФункции
 
 // Получает должность текущего пользователя для служебок
//
// Возвращаемое значение:
//   Строка   - Должность в родительном падеже
//
  Функция ПолучитьДолжностьТекущегоПользователя() Экспорт
	  
	  Если Не ЗначениеЗаполнено(ПараметрыСеанса.ТекПользователь.ЦК) Тогда
	  
	  	 Возврат ПолучитьСклоненияСтроки(НРег(Строка(ПараметрыСеанса.ТекПользователь.Должность)),, "ПД=Родительный")[0];
	  
	  Иначе
	  
	  	 Возврат ПолучитьСклоненияСтроки(НРег(Строка(ПараметрыСеанса.ТекПользователь.Должность)) + " ЦК № " + Строка(ПараметрыСеанса.ТекПользователь.ЦК),, "ПД=Родительный")[0];
	  
	  КонецЕсли; 
 	   
 
   КонецФункции
   
// Получает начало и конец текущего учебного года
//
// Возвращаемое значение:
//   Структура (Период - Дата, НачалоГода - Дата, КонецГода - Дата)
//
 Функция ПолучитьНачалоИКонецУчебногоГода() Экспорт
	 
	СтруктураГода = Новый Структура;
	 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГодовыеГрафикиУчебногоПроцессаСрезПоследних.Период КАК Период,
		|	ГодовыеГрафикиУчебногоПроцессаСрезПоследних.НачалоГода КАК НачалоГода,
		|	ГодовыеГрафикиУчебногоПроцессаСрезПоследних.КонецГода КАК КонецГода
		|ИЗ
		|	РегистрСведений.ГодовыеГрафикиУчебногоПроцесса.СрезПоследних КАК ГодовыеГрафикиУчебногоПроцессаСрезПоследних";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СтруктураГода.Вставить("Период",ВыборкаДетальныеЗаписи.Период);
		СтруктураГода.Вставить("НачалоГода",ВыборкаДетальныеЗаписи.НачалоГода);
		СтруктураГода.Вставить("КонецГода",ВыборкаДетальныеЗаписи.КонецГода);
		
	КонецЦикла;
	
	Если СтруктураГода.Количество() = 0 Тогда
	
		Сообщить("Добавьте учебный год!");
	
	КонецЕсли;
	
	Возврат СтруктураГода;
	
 КонецФункции // ПолучитьНачалоИКонецУчебногоГода()

 // Получает текущего пользователя
//
// Возвращаемое значение:
//   СправочникСсылка.Преподаватели
//
 Функция ПолучитьТекПользователя() Экспорт
 
 	  Возврат ПараметрыСеанса.ТекПользователь;
 
  КонецФункции // ПолучитьТекПользователя()
  
// Получает начало и конец текущего учебного года любого для журнала
//
// Параметры:
// Период - Дата начала года, н-р 01.01.2025
//
// Возвращаемое значение:
//   Структура (Период - Дата, НачалоГода - Дата, КонецГода - Дата)
//
 Функция ПолучитьНачалоИКонецУчебногоГодаЛюбой(Период) Экспорт
	 
	СтруктураГода = Новый Структура;
	 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГодовыеГрафикиУчебногоПроцессаСрезПоследних.Период КАК Период,
		|	ГодовыеГрафикиУчебногоПроцессаСрезПоследних.НачалоГода КАК НачалоГода,
		|	ГодовыеГрафикиУчебногоПроцессаСрезПоследних.КонецГода КАК КонецГода
		|ИЗ
		|	РегистрСведений.ГодовыеГрафикиУчебногоПроцесса.СрезПоследних(&Период, ) КАК ГодовыеГрафикиУчебногоПроцессаСрезПоследних";
	
	Запрос.Параметры.Вставить("Период", Период);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СтруктураГода.Вставить("Период",ВыборкаДетальныеЗаписи.Период);
		СтруктураГода.Вставить("НачалоГода",ВыборкаДетальныеЗаписи.НачалоГода);
		СтруктураГода.Вставить("КонецГода",ВыборкаДетальныеЗаписи.КонецГода);
		
	КонецЦикла;
	
	Если СтруктураГода.Количество() = 0 Тогда
	
		Сообщить("Добавьте учебный год!");
	
	КонецЕсли;
	
	Возврат СтруктураГода;
	
КонецФункции // ПолучитьНачалоИКонецУчебногоГодаЛюбой()

// Получает список всех периодов учебных годов
//
// Возвращаемое значение:
//   Массив - Структуры(Период - Дата, Даты - Строка)
//
 Функция ПолучитьВсеПериодыУчебногоГода() Экспорт
	 
	Мас = Новый Массив; 
	 Периоды = Новый Структура;
	 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГодовыеГрафикиУчебногоПроцесса.Период КАК Период,
		|	ГодовыеГрафикиУчебногоПроцесса.НачалоГода КАК НачалоГода,
		|	ГодовыеГрафикиУчебногоПроцесса.КонецГода КАК КонецГода
		|ИЗ
		|	РегистрСведений.ГодовыеГрафикиУчебногоПроцесса КАК ГодовыеГрафикиУчебногоПроцесса";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Периоды = Новый Структура;
		Периоды.Вставить("Период", ВыборкаДетальныеЗаписи.Период);
		Периоды.Вставить("Даты", Строка(Лев(ВыборкаДетальныеЗаписи.НачалоГода,10)) + Строка(" - ") + Строка(Лев(ВыборкаДетальныеЗаписи.КонецГода,10)));
		Мас.Добавить(Периоды);
	КонецЦикла;
	
	Возврат Мас;
	
КонецФункции // ПолучитьВсеПериодыУчебногоГода()
